'''
Вводиться два числа (a та b). В даному інтервалі потрібно вивести число, яке має 
найбільше дільників. Тобто, якщо а=10, b=20, то потрібно перевірити числа 11, 12, 13…. 20, 
і вивести на екран таке число, яке має найбільше дільників, тобто частка при діленні рівна 0. 
В наведеному прикладі вище потрібно вивести на екран число “18”, оскільки воно має найбільше 
дільників (1, 2, 3, 6, 9, 18) і є максимальним.
'''
def div_max_numbers(a, b):
    nums = range(a, b+1)
    result_num = []
    max_num = [0, 0]
    for i in nums:
        div = 0
        for z in range(1, i+1):
            if i%z == 0:
                div += 1
        result_num.append([i, div])
    for i, j in result_num:
        if i > max_num[0] and j > max_num[1]:
            max_num = [i, j]
        if max_num[0] != b:
            continue
    print(max_num)

div_max_numbers(10, 11)
