'''
Password storage. 
Модифікувати програму генерування паролів, яку ви робили на 6 уроці, а саме: 
1. Після запуску програми, спитати в користувача, що він хоче зробити: створити новий пароль, 
чи отримати пароль, який він вводив раніше. Всі паролі зберігати в якомусь файлі. Отримати 
пароль можна за допомогою певного ключового слова, яке вказує користувач при створенні нового 
пароля. Наприклад: Користувач запускає програму і хоче отримати пароль, який вводив раніше. 
Для цього він вводить ключове слово (напр. Google), за яким ведеться пошук у файлі і отримується 
пароль. Коли ж користувач хоче створити новий пароль, то використати код з програми 6 уроку, 
після генерування пароля попросити в користувача ввести ключове слово, і дану пару ключ-значення 
записати у файл.

2. Після того, як користувач завершив роботу з програмою, попросити в нього ввести цифру 
або слово. Перед закриттям програми зашифрувати увесь текст за шифром Віженера або Цезаря, 
де ключом виступає введене значення. Перед зчитуванням інформації у файлі під час запуску 
програми просити користувача ввести ключове слово або цифру, і розшифрувати зашифровану 
інформацію у файлі за введеним ключем. Після цього пропонувати створювати новий пароль 
або ж отримати існуючий.
'''